In [1]:
# Dataframe is 2 dimentional series object.
import pandas as pd

In [6]:
# let's create a basic DataFrame with the help of series
record1 = pd.Series({"Name" : "Meet", "Class" : "Data Science", "Score" : 90})
record2 = pd.Series({"Name" : "Devraj", "Class" : "UI-UX", "Score" : 91})
record3 = pd.Series({"Name" : "Jay", "Class" : "Machine Learning", "Score" : 92})
record4 = pd.Series({"Name" : "Poojan", "Class" : "Artificial Inteligence", "Score" : 94})

In [7]:
# now we will create the dataframe "df"
df = pd.DataFrame([record1, record2, record3, record4], index = ['School1', 'School2', 'School1', 'School2'])
df

           Name                   Class  Score
School1    Meet            Data Science     90
School2  Devraj                   UI-UX     91
School1     Jay        Machine Learning     92
School2  Poojan  Artificial Inteligence     94

In [9]:
# An alternative way to create the dataframe is with dictionaries. Dictonary works as row in the DataFrame
students = [{"Name" : "Meet", 
             "Class": "Data Science",
             "Score" : 90},
           {"Name" : "Devraj", 
             "Class": "UI-UX",
             "Score" : 91},
           {"Name" : "Poojan", 
             "Class": "Machine Learning",
             "Score" : 93},
           {"Name" : "Jay", 
             "Class": "Artificial Intelligence",
             "Score" : 92}]
df2 = pd.DataFrame(students, index = ['School1', 'School2', 'School1', 'School2'])
df2

           Name                    Class  Score
School1    Meet             Data Science     90
School2  Devraj                    UI-UX     91
School1  Poojan         Machine Learning     93
School2     Jay  Artificial Intelligence     92

In [10]:
# we can get any field of the table with the "loc" 
df2.loc['School2']

           Name                    Class  Score
School2  Devraj                    UI-UX     91
School2     Jay  Artificial Intelligence     92

In [14]:
type(df2.loc['School2'])

pandas.core.frame.DataFrame

In [11]:
# we can get any row of the table with the "loc" 
df2.iloc[1]

Name     Devraj
Class     UI-UX
Score        91
Name: School2, dtype: object

In [12]:
type(df2.iloc[1])

pandas.core.series.Series

In [16]:
# if we want only one column data we can pass 2 parameters in the "loc"
df2.loc["School1", 'Name']

School1      Meet
School1    Poojan
Name: Name, dtype: object

In [17]:
# we can transpose the dataframe with ".T"
df.T

            School1 School2           School1                 School2
Name           Meet  Devraj               Jay                  Poojan
Class  Data Science   UI-UX  Machine Learning  Artificial Inteligence
Score            90      91                92                      94

In [18]:
# for dataframes there is more easier method to get the column as output
df2['Name']

School1      Meet
School2    Devraj
School1    Poojan
School2       Jay
Name: Name, dtype: object

In [19]:
type(df2['Name'])

pandas.core.series.Series

In [20]:
# if we want the name of students who are in the School2
df2.loc['School2']['Name']

School2    Devraj
School2       Jay
Name: Name, dtype: object

In [23]:
# for row selection we can use the colon ":" 
# here the slicing will work as same as python lists
df2.loc[:, ['Name', 'Score']]
# we get all the names and scores

           Name  Score
School1    Meet     90
School2  Devraj     91
School1  Poojan     93
School2     Jay     92

In [24]:
# if we want to remove any row we can use the "drop" function
# it will not change the original Dataframe instead will create the copy of that daraframe.
df2.drop('School2')

           Name             Class  Score
School1    Meet      Data Science     90
School1  Poojan  Machine Learning     93

In [25]:
df2

           Name                    Class  Score
School1    Meet             Data Science     90
School2  Devraj                    UI-UX     91
School1  Poojan         Machine Learning     93
School2     Jay  Artificial Intelligence     92

In [28]:
# we can also delete the data from original dataframe.
# there are another 2 params for the drop function
# the "inplace" is for changing the data in original dataframe
# the "axis" is to modify the data with columns axis = 1 for column
# If we want to delete the score column

copy_df = df.copy()
copy_df.drop("Score", inplace = True, axis = 1)
copy_df

           Name                   Class
School1    Meet            Data Science
School2  Devraj                   UI-UX
School1     Jay        Machine Learning
School2  Poojan  Artificial Inteligence

In [29]:
# there is another way to remove the data from dataFrame
del copy_df["Class"]
copy_df

           Name
School1    Meet
School2  Devraj
School1     Jay
School2  Poojan

In [30]:
# we can add the column and broadcast the data in it
df['ClassRanking'] = None
df

           Name                   Class  Score ClassRanking
School1    Meet            Data Science     90         None
School2  Devraj                   UI-UX     91         None
School1     Jay        Machine Learning     92         None
School2  Poojan  Artificial Inteligence     94         None